Revit 2027 API
StructuralFramingUtils.CanFlipEnds Method
 Determines if the ends of the given framing element can be flipped.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanFlipEnds(
	FamilyInstance familyInstance
)
Public Shared Function CanFlipEnds (
	familyInstance As FamilyInstance
) As Boolean
public:
static bool CanFlipEnds(
	FamilyInstance^ familyInstance
)
static member CanFlipEnds :
        familyInstance : FamilyInstance -> bool
Parameters
familyInstance FamilyInstance
 The FamilyInstance, which must be of a structural framing category, non-concrete.
Return Value
Boolean
 True for non-concrete line, arc or ellipse framing element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace